---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded
source: html/84483530-15b3-5c24-6938-f1167dfb47a2.htm
---
# StructuralSectionIWelded Members

Creates a new instance of Structural Section I Welded shape with the associated set of parameters,
 used to attach to structural element.